Reports/ИА_ВедомостьПоФондам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ВедомостьПоФондам</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ИА_ВедомостьПоФондам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПанельНастроек(Команда)
	Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
	Эл.Пометка = Не Эл.Пометка;
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек.Пометка = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Элементы.ВариантОтчета.Заголовок = "Вариант отчета: " + ПредставлениеТекущегоВарианта;
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	ТабДокРасш = ПолучитьРасшифровкуНаСервере(Расшифровка);	
	Если ТабДокРасш<>Неопределено Тогда
		СтандартнаяОбработка = ложь;
		
		ТабДокРасш.Показать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)
		
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
 
    МассивПолей = ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровкиОбъект, Ложь);
	ОтборФонд = Неопределено;
	ОтборПодр = Неопределено;
	Регистратор = Неопределено;
	
	для каждого п из МассивПолей Цикл
		Попытка
			если п.Поле = "Регистратор" Тогда
				Регистратор = п.Значение;
			ИначеЕсли  п.Поле = "Фонд" Тогда
				ОтборФонд = п.Значение;
			ИначеЕсли  п.Поле = "Подразделение" Тогда
				ОтборПодр = п.Значение;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если Регистратор = Неопределено Тогда
		возврат Неопределено;
	КонецЕсли;
	///////////////////////////////////
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтборФонд", ОтборФонд);
	Запрос.УстановитьПараметр("ОтборПодр", ОтборПодр);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваНаФондах.Период КАК Период,
	               |	ИА_СредстваНаФондах.Регистратор КАК Регистратор,
	               |	ИА_СредстваНаФондах.ВидДвижения КАК ВидДвижения,
	               |	ВЫБОР
	               |		КОГДА ИА_СредстваНаФондах.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |			ТОГДА ИА_СредстваНаФондах.СуммаБезнал
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Приход,
	               |	ВЫБОР
	               |		КОГДА ИА_СредстваНаФондах.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	               |			ТОГДА ИА_СредстваНаФондах.СуммаБезнал
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Расход,
	               |	ИА_СредстваНаФондах.Операция КАК Операция,
	               |	ИА_СредстваНаФондах.ПояснениеТекст КАК ПояснениеТЕкст,
	               |	ИА_СредстваНаФондах.ПояснениеСсылка КАК ПояснениеСсылка,
	               |	ИА_СредстваНаФондах.Фонд КАК Фонд
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваНаФондах КАК ИА_СредстваНаФондах
	               |ГДЕ
	               |	ИА_СредстваНаФондах.Регистратор = &Регистратор
	               |	И (ИА_СредстваНаФондах.Фонд = &ОтборФонд
	               |			ИЛИ &ОтборФонд = НЕОПРЕДЕЛЕНО)
	               |	И (ИА_СредстваНаФондах.Подразделение = &ОтборПодр
	               |			ИЛИ &ОтборПодр = НЕОПРЕДЕЛЕНО)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_СредстваНаФондах.Период";
	тзДетал = запрос.Выполнить().Выгрузить();
	тзФонды = тзДетал.Скопировать();
	тзФонды.Свернуть("Фонд", "Приход,Расход");
	
	ТабДок = новый ТабличныйДокумент;
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.получитьмакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Регистратор = Регистратор;	
	Обл.Параметры.ДатаОтчета = ТекущаяДата();	
	ТабДок.Вывести(обл);
	
	Для каждого стрФонд из тзФонды Цикл
		Обл = макет.ПолучитьОбласть("ДетализацияШапкаФонд");
		Обл.Параметры.Фонд = стрФонд.Фонд;	
		ТабДок.Вывести(обл);
		
		Для каждого стрДет из тзДетал Цикл
			
			Обл = макет.ПолучитьОбласть("ДетализацияСтрока");

			ЗаполнитьЗначенияСвойств(обл.параметры, стрДет);
			обл.параметры.ПояснениеТекст = стрДет.ПояснениеТЕкст + " " + стрДет.ПояснениеСсылка; 
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("ДетализацияИтого");
		обл.параметры.Приход = стрФонд.Приход;
		обл.параметры.Расход = стрФонд.Расход;
		ТабДок.Вывести(обл);
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции



#Область Расшифровка

// Возвращает доступное поле по полю компоновки
&НаСервереБезКонтекста
Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ПолеКомпоновкиДанных, ОбластьПоиска) Экспорт

    Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда

        ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);

    Иначе

        ПолеПоиска = ПолеКомпоновкиДанных;

    КонецЕсли;

    Если ТипЗнч(ОбластьПоиска) = Тип("КомпоновщикНастроекКомпоновкиДанных")

        ИЛИ ТипЗнч(ОбластьПоиска) = Тип("ДанныеРасшифровкиКомпоновкиДанных")

        ИЛИ ТипЗнч(ОбластьПоиска) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда

        Возврат ОбластьПоиска.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);

    Иначе

        Возврат ОбластьПоиска.НайтиПоле(ПолеПоиска);

    КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьРодителей(ЭлементРасшифровки, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы = Ложь) Экспорт

    Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда

        Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл

            ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Новый ПолеКомпоновкиДанных(Поле.Поле), ТекущийОтчет);

            Если ДоступноеПоле = Неопределено Тогда

                Продолжить;

            КонецЕсли;

            Если Не ВключатьРесурсы И ДоступноеПоле.Ресурс Тогда

                Продолжить;

            КонецЕсли;

            МассивПолейРасшифровки.Добавить(Поле);

        КонецЦикла;

    КонецЕсли;

    Для каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл

        ДобавитьРодителей(Родитель, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);

    КонецЦикла;

КонецФункции

// Возвращает массив, по которому следует расшифровать отчет

&НаСервереБезКонтекста
Функция ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки, ВключатьРесурсы = Ложь) Экспорт

    МассивПолейРасшифровки = Новый Массив;

    Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных")

        И ТипЗнч(Расшифровка) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда

        Возврат МассивПолейРасшифровки;

    КонецЕсли;

    // Добавим поля родительских группировок

    ДобавитьРодителей(ДанныеРасшифровки.Элементы[Расшифровка], ДанныеРасшифровки, МассивПолейРасшифровки, ВключатьРесурсы);

    Количество = МассивПолейРасшифровки.Количество();

    Для Индекс = 1 По Количество Цикл

        ОбратныйИндекс = Количество - Индекс;

        Для ИндексВнутри = 0 По ОбратныйИндекс - 1 Цикл

            Если МассивПолейРасшифровки[ОбратныйИндекс].Поле = МассивПолейРасшифровки[ИндексВнутри].Поле Тогда

                МассивПолейРасшифровки.Удалить(ОбратныйИндекс);

                Прервать;

            КонецЕсли;

        КонецЦикла;

    КонецЦикла;

    // Добавим отбор, установленный в отчете

    Для каждого ЭлементОтбора Из ДанныеРасшифровки.Настройки.Отбор.Элементы Цикл

        Если Не ЭлементОтбора.Использование Тогда

            Продолжить;

        КонецЕсли;

        МассивПолейРасшифровки.Добавить(ЭлементОтбора);

    КонецЦикла;

    Возврат МассивПолейРасшифровки;

КонецФункции

#КонецОбласти
